[
  {
    "id": "mrcf-uas-utm-2026-01-05",
    "title": "UAS and UTM on the Modular Horizon: How MRCF Structures Next-Gen Aerial Systems",
    "slug": "uas-utm-mrcf-modular-horizon",
    "summary": "Overview of UAS/UTM challenges and how the Modular Research and Control Framework (MRCF) enables interoperable, research-driven deployments.",
    "content_markdown": "# UAS and UTM on the Modular Horizon\n\n**Abstract:** This article presents the Modular Research and Control Framework (MRCF) and explains how it supports the integration of UAS within UTM ecosystems, enabling modular mission orchestration, reproducible research, and collaborative development.\n\n## Introduction\nThe rapid growth of unmanned aerial systems (UAS) demands interoperable frameworks to operate safely within complex airspaces. Unmanned Traffic Management (UTM) systems are emerging to coordinate this activity. However, current solutions often lack modularity and research-friendly interfaces. The MRCF addresses this gap by providing modular building blocks for mission design, data exchange, and testing.\n\n## Why modularity matters\nModularity accelerates development by enabling researchers to reuse components, run isolated experiments, and compose systems for specific missions. MRCF defines clear interfaces for sensors, planners, and telemetry, supporting both simulation and field deployment.\n\n## MRCF in UTM contexts\nMRCF supports standardized message models and service contracts that can interoperate with UTM actors (e.g., UAS Service Suppliers, UTM Core) while preserving research traceability.\n\n## Benefits for research and collaboration\n- Reproducible mission configs\n- Git-centered versioning of components\n- Easier onboarding of students and collaborators\n\n## Call to collaborate\nIf you are interested in co-authoring, implementing a component, or pursuing supervised research under the MRCF umbrella, contact the author and check the MRCF GitHub repository: https://github.com/JtveigaIta/mrcf\n\n---\n\nContact: Jackson T. Veiga — [GitHub](https://jtveigaita.github.io/planar/)\n",
    "publish_date": "2024-01-01T09:00:00-03:00",
    "tags": ["UAS", "UTM", "MRCF", "modularity", "research"]
  }

]
